Tekla.Structures.Analysis.AnalysisPart.PartTypeEnum
The types of the physical model part.

Tekla.Structures.Analysis.AnalysisPart.PartTypeEnum.PART
The part is a normal part.

Tekla.Structures.Analysis.AnalysisPart.PartTypeEnum.BOOLEAN_ADD_PART
The part is a boolean add part.